{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.21.0",
  "convertedBy": "PyTorch to TensorFlow.js Converter",
  "modelTopology": {
    "keras_version": "2.13.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "compatibility_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 8],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 8,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output_layer",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [["accuracy"]],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.001,
          "decay": 0.0,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense_1/kernel", "shape": [8, 16], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [16], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [16, 8], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [8], "dtype": "float32"},
        {"name": "output_layer/kernel", "shape": [8, 1], "dtype": "float32"},
        {"name": "output_layer/bias", "shape": [1], "dtype": "float32"}
      ]
    }
  ]
}

